08_RTD_openFoam/OpenFoam12/tundishBasic2D/tundishFlow2D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 10;

boundaryField
{

    walls
    {
        type            epsilonWallFunction;
        value           uniform 10;
    }

    top
    {
        type            epsilonWallFunction;
        value           uniform 10;
    }

    bottom
    {
        type            epsilonWallFunction;
        value           uniform 10;
    }

    obstacle
    {
        type            epsilonWallFunction;
        value           uniform 10;
    }
    
    defaultFaces
    {
        type            empty;
    }

    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.01;
        value           uniform 10;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
