08_RTD_openFoam/OpenFoam12/tundishBasic2D/tundishFlow2D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{

    walls
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }

    top
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }

    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }

    obstacle
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    
    defaultFaces
    {
        type            empty;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;
        value           uniform 0.375;
    }

    outlet
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
